package com.zdream.pmw.platform.effect.type;

import com.zdream.pmw.monster.prototype.EPokemonType;

/**
 * 属性克制表<br>
 * 
 * @since v0.1
 * @author Zdream
 * @date 2016年4月10日
 * @version v0.1
 */
public class TypeRestraint {
	
	private byte[][] table = new byte[][]{
		{2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2},
		{2,2,2,2,2,2,1,2,0,1,2,2,2,2,2,2,2,2,2},
		{2,3,2,1,1,2,3,1,0,3,2,2,2,2,1,3,2,3,1},
		{2,2,3,2,2,2,1,3,2,1,2,2,3,1,2,2,2,2,2},
		{2,2,2,2,1,1,1,2,1,0,2,2,3,2,2,2,2,2,3},
		{2,2,2,0,3,2,3,1,2,3,3,2,1,3,2,2,2,2,2},
		{2,2,1,3,2,1,2,3,2,1,3,2,2,2,2,3,2,2,2},
		{2,2,1,1,1,2,2,2,1,1,1,2,3,2,3,2,2,3,1},
		{2,0,2,2,2,2,2,2,3,2,2,2,2,2,3,2,2,1,2},
		{2,2,2,2,2,2,3,2,2,1,1,1,2,1,2,3,2,2,3},
		{2,2,2,2,2,2,1,3,2,3,1,1,3,2,2,3,1,2,2},
		{2,2,2,2,2,3,3,2,2,2,3,1,1,2,2,2,1,2,2},
		{2,2,2,1,1,3,3,1,2,1,1,3,1,2,2,2,1,2,2},
		{2,2,2,3,2,0,2,2,2,2,2,3,1,1,2,2,1,2,2},
		{2,2,3,2,3,2,2,2,2,1,2,2,2,2,1,2,2,0,2},
		{2,2,2,3,2,3,2,2,2,1,1,1,3,2,2,1,3,2,2},
		{2,2,2,2,2,2,2,2,2,1,2,2,2,2,2,2,3,2,0},
		{2,2,1,2,2,2,2,2,3,2,2,2,2,2,3,2,2,1,1},
		{2,2,3,2,1,2,2,2,2,1,1,2,2,2,2,2,3,3,2},
	};
	
	/**
	 * 获得属性克制倍率
	 * @param atType
	 *   攻击方属性
	 * @param dfType
	 *   防御方属性
	 * @return
	 */
	public float getRestraintRate(EPokemonType atType, EPokemonType dfType) {
		byte value = table[atType.ordinal()][dfType.ordinal()];
		
		switch (value) {
		case 0:
			return 0.0f;
		case 1:
			return 0.5f;
		case 3:
			return 2.0f;
		default:
			return 1.0f;
		}
	}

}
